# 문제


# 현대모비스는 글로벌 자동차 부품 기업으로 자율주행, 커넥티비티, 전동화 분야에 역량을 집중해 스마트 모빌리티 시대를 선도하고 있는 기업입니다.

# 현대모비스는 소프트웨어 생태계 조성을 위해 소프트웨어 아카데미를 운영하고 있으며, 내부적으로는 연구원들의 소프트웨어 직무교육 이수를 통해 우수인재를 육성하고, 대외적으로는 채용 연계형 프로그램을 운영하여 취업 준비생들에게 소프트웨어 전문 교육을 무상으로 제공하고, 더 나아가 우수 이수자들을 채용하고 있습니다.

# 현대모비스에서 소프트웨어 아카데미 견학생을 모집한다고 한다. 이번 견학 활동은 모두 팀 단위로 진행되며 아래 두 조건을 모두 만족하는 팀만 소프트웨어 아카데미를 견학할 수 있다.

# 팀원이 두 명이다.
# 팀의 능력치가 
# $M$ 이상이다. 팀의 능력치는 모든 팀원의 능력치를 합한 값이다.
# Sogang ICPC Team 학회원 
# $N$명이 견학을 희망한다. 학회장 동건이는 
# $N$명으로 최대한 많은 팀을 만들어 견학을 보내고 싶다. 동건이가 최대 몇 팀이나 견학 보낼 수 있을지 구해보자.

# 입력
# 첫째 줄에 견학을 희망하는 학회원의 수 
# $N$과 견학하는 팀의 최소 능력치를 나타내는 정수 
# $M$이 공백으로 구분되어 주어진다. (
# $1 \le N \le 100\,000$, 
# $1 \le M \le 10^9$)

# 둘째 줄에 학회원 
# $N$명의 능력치를 나타내는 
# $N$개의 정수 
# $a_1,a_2, \cdots, a_N$이 공백으로 구분되어 주어진다. (
# $1 \le a_i \le 10^9$)

# 출력
# 첫째 줄에 동건이가 견학 보낼 수 있는 최대 팀 수를 출력한다.

N, M =map(int,input().split())

student = list(map(int,input().split()))
student.sort()

l = 0
r = len(student)-1
count = 0

while l<r:
    if(student[l]+student[r]>=M):
        count+=1
        l+=1
        r-=1
    elif(student[l]+student[r]<M):
        l+=1
print(count)